avnet-iotconnect/iotc-mchp-dspic33ck-mcsk-rnwf11/firmware/dspic33ck256mp508_rnwf11_iotconnect.X/bldc_main.c
/*******************************************************************************
  Sensored BLDCM Drive main functions, interrupts and subroutines.

  File Name:
    bldc_main.c

  Summary:
    This main file runs the BLDCM drive related functions, interrupts and
    subroutines.

  Description:
    Definitions in the file are for dsPIC33CK256MP508 External OP-AMP PIM
    plugged onto Motor Control Development board from Microchip.
*******************************************************************************/
/*******************************************************************************
* Copyright (c) 2019 released Microchip Technology Inc.  All rights reserved.
*
* SOFTWARE LICENSE AGREEMENT:
* 
* Microchip Technology Incorporated ("Microchip") retains all ownership and
* intellectual property rights in the code accompanying this message and in all
* derivatives hereto.  You may use this code, and any derivatives created by
* any person or entity by or on your behalf, exclusively with Microchip's
* proprietary products.  Your acceptance and/or use of this code constitutes
* agreement to the terms and conditions of this notice.
*
* CODE ACCOMPANYING THIS MESSAGE IS SUPPLIED BY MICROCHIP "AS IS".  NO
* WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
* TO, IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A
* PARTICULAR PURPOSE APPLY TO THIS CODE, ITS INTERACTION WITH MICROCHIP'S
* PRODUCTS, COMBINATION WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.
*
* YOU ACKNOWLEDGE AND AGREE THAT, IN NO EVENT, SHALL MICROCHIP BE LIABLE,
* WHETHER IN CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE OR BREACH OF
* STATUTORY DUTY),STRICT LIABILITY, INDEMNITY, CONTRIBUTION, OR OTHERWISE,
* FOR ANY INDIRECT, SPECIAL,PUNITIVE, EXEMPLARY, INCIDENTAL OR CONSEQUENTIAL
* LOSS, DAMAGE, FOR COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE CODE,
* HOWSOEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR
* THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT ALLOWABLE BY LAW,
* MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS CODE,
* SHALL NOT EXCEED THE PRICE YOU PAID DIRECTLY TO MICROCHIP SPECIFICALLY TO
* HAVE THIS CODE DEVELOPED.
*
* You agree that you are solely responsible for testing the code and
* determining its suitability.  Microchip has no obligation to modify, test,
* certify, or support the code.
*
*******************************************************************************/
// *****************************************************************************
// *****************************************************************************
// Section: Included Files
// *****************************************************************************
// *****************************************************************************
#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include "bldc_main.h"
#include "board_service.h"
#include "debug_console.h"
#include "iotconnect_rnwf11_config.h"
#include "port_config.h"
#include "general.h"
#include "clock.h"
#include "iotconnect_rnwf11.h"
// *****************************************************************************
// *****************************************************************************
// Section: MODE OF OPERATION
// *****************************************************************************
// *****************************************************************************  
// desiredSpeed defaults to 50% of MAX_MOTORSPEED so the motor has a sensible
// speed to run at before the first "motor-speed" C2D command ever arrives.
// This is a one-time boot default, not reapplied on every stop/restart -
// MCAPP_INIT (re-entered on every stop cycle) deliberately does not touch it,
// so a speed set via MCAPP_MotorSetSpeedPercent() still holds across a
// motor-stop/motor-start cycle, per its documented behavior.
// The multiply must be done in 32 bits: int is 16 bits on the dsPIC, so a plain
// (MAX_MOTORSPEED * 50) overflows (230000 wraps to -32144, giving a default of
// -321 RPM - i.e. 65215 in the unsigned field - and a stalled speed loop).
MCAPP_DATA_T     mcappData = { .desiredSpeed = (uint16_t)(((uint32_t)MAX_MOTORSPEED * 50UL) / 100UL) };
/******************************************************************************
 * Description: The main function initialises the microcontroller port configurations
 *              and settings. It is the main program which also reads the button 
 *              data, that runs the mtor as well as reverses the direction of spin.
 *****************************************************************************/
int main(void)
{
    HAL_SystemInitialize();
    DEBUG_Initialize();
    DEBUG_Printf("\r\nMCSK BLDC + IoTConnect\r\n");
    HAL_BoardServiceInit();
    mcappData.state = MCAPP_INIT;
    HAL_MC1HallStateChangeTimerPrescalerSet(SPEED_MEASURE_TIMER_PRESCALER);
    HAL_MC1HallStateChangeMaxPeriodSet(SPEED_MULTI);
    HAL_MC1HallStateChangeTimerStart();
    LED1 = 1;
    IOTC_RNWF11_Initialize();

	while(1)
	{
    IOTC_RNWF11_Telemetry_t telemetry = {
        .motorRunning = mcappData.runMotor,
        .state = mcappData.state,
        .sector = mcappData.sector,
        .requestedSpeedRpm = mcappData.desiredSpeed,
        .measuredSpeedRpm = mcappData.calculateSpeed.speedValue,
        .requestedCurrent = mcappData.desiredCurrent,
        .measuredCurrent = mcappData.measuredCurrent,
        .dutyCycle = mcappData.dutyCycle,
        .dcBusAdc = mcappData.analogInputs.measureVdc.value
    };
        // SW1 stays live as a manual on/off override - e.g. to stop the motor
        // by hand if the internet connection drops - but it is handled in the
        // ADC interrupt (MCAPP_ButtonTick), not here: the calls below block for
        // long stretches (Wi-Fi/MQTT connect waits, scope publishing), and a
        // button polled from this loop is simply not seen while they run. SW2
        // (reverse) and the potentiometer (speed) are intentionally not read:
        // those are cloud-only, driven by /IOTCONNECT C2D commands (see
        // MCAPP_Motor* in this file and IOTC_RNWF11_OnCommand() in
        // iotconnect/iotconnect_rnwf11.c).
        IOTC_RNWF11_SetTelemetry(&telemetry);
        IOTC_RNWF11_CheckProvisioning();
        IOTC_RNWF11_Task();
    }
}
/******************************************************************************
 * Description: The MCAPP_LoadSwitchingTable function initializes and loads the
 *              switching table into an array required for forward and reverse
 *              rotation of motor.
 *****************************************************************************/
void MCAPP_LoadSwitchingTable()
{
	uint16_t arrayIndex = 0;
    
	if(mcappData.runDirection == 1)
    {
	    for(arrayIndex = 0; arrayIndex < 8; arrayIndex++)
        {
            PWM_STATE1[arrayIndex] = PWM_STATE1_CLKW[arrayIndex];
            PWM_STATE2[arrayIndex] = PWM_STATE2_CLKW[arrayIndex];
            PWM_STATE3[arrayIndex] = PWM_STATE3_CLKW[arrayIndex];
		}
	}
    else
    {
		for(arrayIndex = 0;arrayIndex < 8; arrayIndex++)
        {
            PWM_STATE1[arrayIndex] = PWM_STATE1_CLKW[7-arrayIndex];
            PWM_STATE2[arrayIndex] = PWM_STATE2_CLKW[7-arrayIndex];
            PWM_STATE3[arrayIndex] = PWM_STATE3_CLKW[7-arrayIndex];
        }
    }
}
/******************************************************************************
 * Description: The MCAPP_CheckHallUpdatePWM function reads the Hall Sensor data
 *              and generates the switching pattern based on its sector.
 *****************************************************************************/
void MCAPP_CheckHallUpdatePWM(void)
{
    mcappData.sector = HAL_MC1HallValueRead();
    if((mcappData.sector >=1) && (mcappData.sector <= 6))
    {
        //set PWM overdrive to the corresponding PWM channel
        PWM1_SwapOverrideEnableDataSet(PWM_STATE1[mcappData.sector]);
        PWM2_SwapOverrideEnableDataSet(PWM_STATE2[mcappData.sector]);
        PWM3_SwapOverrideEnableDataSet(PWM_STATE3[mcappData.sector]);      
    }
}
/******************************************************************************
 * Description: Cloud (IoTConnect C2D) motor control entry points. Start/stop
 *              can also come from SW1 (see main()'s loop above) as a manual
 *              override; direction and speed are cloud-only (SW2 and the
 *              potentiometer are intentionally not read for those). LED2
 *              lives here (not in main()'s button handler) so it reflects
 *              runCmd regardless of which path changed it.
 *****************************************************************************/
void MCAPP_MotorStart(void)
{
    mcappData.runCmd = 1;
    LED2 = 1;
}

