avnet-iotconnect/iotc-mchp-dspic33ck-mcsk-rnwf11/firmware/dspic33ck256mp508_rnwf11_iotconnect.X/bldc_main.c
void MCAPP_MotorStop(void)
{
    mcappData.runCmd = 0;
    LED2 = 0;
}

void MCAPP_MotorReverse(void)
{
    if (mcappData.changeDirection == 0)
    {
        mcappData.changeDirection = 1;
    }
}

void MCAPP_MotorSetSpeedPercent(uint8_t percent)
{
    if (percent > 100U)
    {
        percent = 100U;
    }
    mcappData.desiredSpeed = (uint16_t)(((uint32_t)MAX_MOTORSPEED * percent) / 100U);
}
/******************************************************************************
 * Description: Software oscilloscope capture - see scope_commands.h. State is
 *              a single-writer handoff between HAL_MC1ADCInterrupt() (owns it
 *              while armed) and the command/publish side in main()'s context
 *              (only touches it once SCOPE_IsReady(), i.e. once the ISR has
 *              stopped writing), so no locking is needed - the same pattern
 *              mcappData itself already relies on elsewhere in this file.
 *****************************************************************************/
#define SCOPE_RATE_TICKS_MIN  1U
#define SCOPE_LENGTH_MIN      10U
#define SCOPE_ADC_TICK_US     LOOPTIME_MICROSEC // 50us per HAL_MC1ADCInterrupt() call

static volatile bool scopeArmed;
static volatile bool scopeReady;
// Defaults chosen against this motor's actual electrical rate, not arbitrary
// round numbers: MAX_MOTORSPEED=4600 RPM with POLEPAIRS=2 gives one electrical
// revolution every ~6.5ms at max speed (~13ms at the 50%-speed boot default -
// see mcappData's initializer above). 10 ticks * 50us = 500us/sample gives
// ~13 samples/electrical-cycle at max speed (~26 at the 50% default) - enough
// to resolve waveform shape, not just a Nyquist-minimum zigzag - while the
// default 50-sample length spans a 25ms window, i.e. several full electrical
// cycles at any speed the motor actually runs at.
static uint8_t scopeChannel;              // SCOPE_CHANNEL_* - defaults to SCOPE_CHANNEL_VDC (0)
static uint16_t scopeRateTicks = 10U;     // 10 ticks * 50us = 500us default
static uint16_t scopeLength = 50U;        // default capture length (500us * 50 = 25ms window)
static uint16_t scopeTickCounter;
static uint16_t scopeSampleIndex;
static int16_t scopeBuffer[SCOPE_BUFFER_MAX];

void SCOPE_SetChannel(uint8_t channel)
{
    if (channel > SCOPE_CHANNEL_MAX)
    {
        channel = SCOPE_CHANNEL_MAX;
    }
    scopeChannel = channel;
}

void SCOPE_SetRateMicroseconds(uint32_t us)
{
    uint32_t ticks = (us + (SCOPE_ADC_TICK_US / 2U)) / SCOPE_ADC_TICK_US; // round to nearest tick
    if (ticks < SCOPE_RATE_TICKS_MIN)
    {
        ticks = SCOPE_RATE_TICKS_MIN;
    }
    if (ticks > 0xFFFFU)
    {
        ticks = 0xFFFFU;
    }
    scopeRateTicks = (uint16_t)ticks;
}

void SCOPE_SetLength(uint16_t length)
{
    if (length < SCOPE_LENGTH_MIN)
    {
        length = SCOPE_LENGTH_MIN;
    }
    else if (length > SCOPE_BUFFER_MAX)
    {
        length = SCOPE_BUFFER_MAX;
    }
    scopeLength = length;
}

void SCOPE_StartCapture(void)
{
    scopeReady = false;
    scopeSampleIndex = 0;
    scopeTickCounter = 0;
    scopeArmed = true; // must be last - see the single-writer-handoff note above
}

bool SCOPE_IsReady(void)
{
    return scopeReady;
}

void SCOPE_ClearReady(void)
{
    scopeReady = false;
}

uint8_t SCOPE_GetChannel(void)
{
    return scopeChannel;
}

uint32_t SCOPE_GetRateMicroseconds(void)
{
    return (uint32_t)scopeRateTicks * SCOPE_ADC_TICK_US;
}

uint16_t SCOPE_GetLength(void)
{
    return scopeLength;
}

int16_t SCOPE_GetSample(uint16_t index)
{
    if (index >= scopeLength)
    {
        return 0;
    }
    return scopeBuffer[index];
}

// Called once per HAL_MC1ADCInterrupt() tick (every 50us) - see the call site there.
static void SCOPE_Tick(void)
{
    if (!scopeArmed)
    {
        return;
    }
    if (++scopeTickCounter < scopeRateTicks)
    {
        return;
    }
    scopeTickCounter = 0;

    int16_t value;
    switch (scopeChannel)
    {
        case SCOPE_CHANNEL_DUTY:
            value = mcappData.dutyCycle;
            break;
        case SCOPE_CHANNEL_IBUS:
            value = mcappData.analogInputs.measureCurrent.Ibus;
            break;
        case SCOPE_CHANNEL_IA:
            value = mcappData.analogInputs.measureCurrent.Ia;
            break;
        case SCOPE_CHANNEL_IB:
            value = mcappData.analogInputs.measureCurrent.Ib;
            break;
        case SCOPE_CHANNEL_VDC:
        default:
            value = mcappData.analogInputs.measureVdc.value;
            break;
    }
    scopeBuffer[scopeSampleIndex++] = value;
    if (scopeSampleIndex >= scopeLength)
    {
        scopeArmed = false;
        scopeReady = true;
    }
}
/******************************************************************************
 * Description: The ADCAN19 Interrupt operates at 20kHz. The analog data such as
 *              the potentiometer voltage, Bus Current are read. It services
 *              the MCAPP_StateMachine routine as well.
 *****************************************************************************/
/******************************************************************************
 * Description: SW1 start/stop override, run from the ADC interrupt so it keeps
 *              working no matter what the main loop is blocked on. Same
 *              behavior as the stock HAL_BoardService() scan it replaces: SW1
 *              is active-low (pulled up on the board, closes to ground), and a
 *              press is accepted once the button has been released for at least
 *              BUTTON_DEBOUNCE_COUNT ms beforehand, so contact bounce and a
 *              button held down at power-up are ignored. A press toggles the
 *              motor: it stops a running motor, or starts a stopped one.
 *****************************************************************************/
static void MCAPP_ButtonTick(void)
{
    static uint8_t divider;
    static uint8_t releasedMs;

    if (++divider < BOARD_SERVICE_TICK_COUNT) // every 20 ticks = 1 ms
    {
        return;
    }
    divider = 0;

    if (SW1)
    {
        if (releasedMs < BUTTON_DEBOUNCE_COUNT)
        {
            releasedMs++;
        }
    }
    else
    {
        if (releasedMs >= BUTTON_DEBOUNCE_COUNT)
        {
            if (mcappData.runCmd == 0)
            {
                MCAPP_MotorStart();
            }
            else
            {
                MCAPP_MotorStop();
            }
        }
        releasedMs = 0;
    }
}
void __attribute__((__interrupt__,no_auto_psv)) HAL_MC1ADCInterrupt()
{
    static uint8_t iotcTickDivider;
    if (++iotcTickDivider >= 20U)
    {
        iotcTickDivider = 0;
        IOTC_RNWF11_Tick1ms();
    }
/**  Routine to read the potentiometer value and the bus current value */
    HAL_MC1MotorInputsRead(&mcappData.analogInputs);
/**  SW1 manual start/stop override (before the state machine so a stop acts this tick) */
    MCAPP_ButtonTick();
/**  Routine to run the Motor Control State Machine */
    MCAPP_StateMachine();
/**  Software oscilloscope sample point - see scope_commands.h */
    SCOPE_Tick();

    HAL_MC1ADCInterruptFlagClear();
}
/******************************************************************************
 * Description: The CND Interrupt is serviced at every hall signal transition. 
 *              This enables to calculate the speed based on the time taken for
 *              360 degree electrical rotation.
 *****************************************************************************/
void __attribute__((interrupt, no_auto_psv)) HAL_MC1HallStateChangeInterrupt ()
{
    MCAPP_CheckHallUpdatePWM();

/** Calculation of time taken to complete 360 electrical degrees & is obtained from sector 1 */
/** The sector can be set to any value between 1 to 6 */   
    if (mcappData.sector == 1)
    {
        mcappData.timerValue = SCCP4_TimerDataRead();
    /** Routine to calculate the instantaneous speed from the timer value obtained */    
        MCAPP_SpeedCalculate(mcappData.timerValue);   
    /** Routine to find the moving average of the instantaneous speed values obtained */    
        MCAPP_CalcMovingAvgSpeed(mcappData.calculateSpeed.speedValue);        
    }

    HAL_MC1HallStateChangeInterruptFlagClear();
}
/******************************************************************************
 * Description: The MCAPP_StateMachine describes the code flow and controls the
 *              BLDC motor based on its state. Thus enabling smooth control of motor
 *              and is easily understood by the user.
 *****************************************************************************/
void MCAPP_StateMachine(void)
{
    switch(mcappData.state)
    {
        case MCAPP_INIT:
            
            HAL_MC1PWMDisableOutputs();
            
            mcappData.runMotor = 0;
            mcappData.pwmPeriod = PWM_MasterPeriodRead();
            mcappData.dutyCycle = START_DUTY;
            mcappData.timerValue = 0;
            mcappData.sector = 0;
            mcappData.calculateSpeed.timerDeltaPreScaler = TimerCountPrescaler;
            mcappData.calculateSpeed.speedValue = 0;
            MCAPP_InitControlParameters();
            MCAPP_InitMovingAvgCurrent();        //Routine to Initialize the Moving Average Filter Block
            MCAPP_InitMovingAvgSpeed();     
            HAL_MC1HallStateChangeDetectionEnable();
            mcappData.state = MCAPP_CMD_WAIT;
            
        break;

        case MCAPP_CMD_WAIT:
            
            if(mcappData.runCmd == 1)
            {
                MCAPP_LoadSwitchingTable(mcappData.runDirection);
                
