avnet-iotconnect/iotc-mchp-dspic33ck-mcsk-rnwf11/firmware/dspic33ck256mp508_rnwf11_iotconnect.X/bldc_main.c
                mcappData.runMotor = 1; 
                
                HAL_MC1HallStateChangeDetectionEnable();
                mcappData.state = MCAPP_RUN;
            }
            
            if(mcappData.changeDirection == 1)
            {              
                if(mcappData.runDirection == 0)
                {
                    mcappData.runDirection = 1;
                }
                else
                {
                    mcappData.runDirection = 0;
                }
                mcappData.changeDirection = 0;
                MCAPP_LoadSwitchingTable(mcappData.runDirection);
            }
        break;

        case MCAPP_OFFSET:
        break;

        case MCAPP_RUN:
          
            MCAPP_CheckHallUpdatePWM();
            
            #ifdef   OPENLOOP                      
            mcappData.dutyCycle = (int16_t)((__builtin_mulss(mcappData.analogInputs.measurePot,
                                        mcappData.pwmPeriod)>>15)); 
            if(mcappData.dutyCycle <= MIN_DUTY)
            {
                mcappData.dutyCycle = MIN_DUTY;
            }
            #endif

            #ifdef   SPEED_PI_CLOSEDLOOP
            // desiredSpeed is set exclusively by MCAPP_MotorSetSpeedPercent()
            // (via a "motor-speed" C2D command) - the potentiometer no longer
            // drives it, so it is not recomputed here.
            mcappData.piInputSpeed.inMeasure = mcappData.calculateSpeed.speedValue;
            mcappData.piInputSpeed.inReference = mcappData.desiredSpeed;
            MC_ControllerPIUpdate_Assembly(mcappData.piInputSpeed.inReference,
                                           mcappData.piInputSpeed.inMeasure,
                                           &mcappData.piInputSpeed.piState,
                                           &mcappData.piOutputSpeed.out);
            mcappData.dutyCycle = (int16_t) (__builtin_mulss(mcappData.piOutputSpeed.out, mcappData.pwmPeriod) >> 15);
            #endif

            #ifdef   CURRENT_PI_CLOSEDLOOP
            mcappData.desiredCurrent = (int16_t) (__builtin_mulss(DESIRED_CURRENT_LIMIT, mcappData.analogInputs.measurePot) >> 15);
            mcappData.measuredCurrent = (mcappData.analogInputs.measureCurrent.Ibus); // zero offset can be set if required.
            MCAPP_CalcMovingAvgCurrent(mcappData.measuredCurrent);
            mcappData.piInputCurrent.inMeasure = mcappData.movingAvgFilterCurrent.avg;
            mcappData.piInputCurrent.inReference = mcappData.desiredCurrent;
            MC_ControllerPIUpdate_Assembly(mcappData.piInputCurrent.inReference,
                                           mcappData.piInputCurrent.inMeasure,
                                           &mcappData.piInputCurrent.piState,
                                           &mcappData.piOutputCurrent.out);
            mcappData.dutyCycle = (int16_t) (__builtin_mulss(mcappData.piOutputCurrent.out, mcappData.pwmPeriod) >> 15);
            #endif

            /** Set Duty Cycle */
            HAL_MC1PWMSetDutyCyclesIdentical(mcappData.dutyCycle);
            
            if(mcappData.changeDirection == 1)
            {
                mcappData.dutyCycle = 0;
                HAL_MC1PWMSetDutyCyclesIdentical(mcappData.dutyCycle);
                HAL_MC1PWMDisableOutputs();
                mcappData.state =  MCAPP_CHANGE_DIRECTION;
            }
            
            if(mcappData.runCmd == 0)
            {
                mcappData.state = MCAPP_STOP;
            }
            
        break;
        
        case MCAPP_CHANGE_DIRECTION:
            
            if(mcappData.changeDirection == 1)
            {              
                if(mcappData.runDirection == 0)
                {
                    mcappData.runDirection = 1;
                }
                else
                {
                    mcappData.runDirection = 0;
                }
                mcappData.changeDirection = 0;
                MCAPP_LoadSwitchingTable(mcappData.runDirection);
            }
            
            /*Wait for speed to reduce to a safe speed before reversing the direction*/
            if(mcappData.timerValue > REV_SPEED_LIMIT )  
            {
                mcappData.state = MCAPP_RUN;  
                HAL_MC1PWMEnableOutputs();
            }
            break;
        
        case MCAPP_STOP:
            
            mcappData.sector = 0;
            
            /** Set Duty Cycle */
            mcappData.dutyCycle = 0;
            HAL_MC1PWMSetDutyCyclesIdentical(mcappData.dutyCycle);
            HAL_MC1PWMDisableOutputs();
            
            mcappData.state = MCAPP_INIT;
            
        break;

        case MCAPP_FAULT:
        break;
    }
}
/******************************************************************************
 * Description: The MCAPP_InitControlParameters function initializes the
 *              standard PI constants that are set in user defined variables in
 *              bldc_main.h file
 *****************************************************************************/
void MCAPP_InitControlParameters(void)
{
    /** PI - Speed Control */
    mcappData.piInputSpeed.piState.kp         = SPEEDCNTR_PTERM;
    mcappData.piInputSpeed.piState.ki         = SPEEDCNTR_ITERM;
    mcappData.piInputSpeed.piState.kc         = SPEEDCNTR_CTERM;
    mcappData.piInputSpeed.piState.outMax     = SPEEDCNTR_OUTMAX;
    mcappData.piInputSpeed.piState.outMin     = SPEEDCNTR_OUTMIN;
    mcappData.piInputSpeed.piState.integrator = 0;
    mcappData.piOutputSpeed.out               = 0;
    
    /** PI - Current Control */
    mcappData.piInputCurrent.piState.kp         = CURRCNTR_PTERM;
    mcappData.piInputCurrent.piState.ki         = CURRCNTR_ITERM;
    mcappData.piInputCurrent.piState.kc         = CURRCNTR_CTERM;
    mcappData.piInputCurrent.piState.outMax     = CURRCNTR_OUTMAX;
    mcappData.piInputCurrent.piState.outMin     = 0;
    mcappData.piInputCurrent.piState.integrator = 0;
    mcappData.piOutputCurrent.out               = 0;
    
    mcappData.calculateSpeed.timeIntervalMax = SPEED_MULTI+1;
}
/******************************************************************************
 * Description: The MCAPP_InitMovingAvgCurrent function initializes the current 
 *              array table that is being used to calculate the moving average,
 *              thereby eliminate the undesired response and variations during
 *              reset and restart of motor.
 *****************************************************************************/
void MCAPP_InitMovingAvgCurrent(void)
{
    uint16_t i;
    
    for(i=0; i<CURRENT_MOVING_AVG_FILTER_SIZE; i++)
    {
        mcappData.movingAvgFilterCurrent.buffer[i] = 0;
    }
    
    mcappData.movingAvgFilterCurrent.index = 0;
    mcappData.movingAvgFilterCurrent.sum = 0;
    mcappData.movingAvgFilterCurrent.avg = 0;
}
/******************************************************************************
 * Description: The MCAPP_CalcMovingAvgCurrent function calculates the moving
 *              average of bus current.
 *****************************************************************************/
void MCAPP_CalcMovingAvgCurrent(int16_t instCurrent)
{
    uint16_t i;
    
    mcappData.movingAvgFilterCurrent.buffer[mcappData.movingAvgFilterCurrent.index] = instCurrent;
    mcappData.movingAvgFilterCurrent.index++;
    if(mcappData.movingAvgFilterCurrent.index >= CURRENT_MOVING_AVG_FILTER_SIZE)
       mcappData.movingAvgFilterCurrent.index = 0;
    
    mcappData.movingAvgFilterCurrent.sum = 0;
    for(i=0; i<CURRENT_MOVING_AVG_FILTER_SIZE; i++)
    {
        mcappData.movingAvgFilterCurrent.sum = mcappData.movingAvgFilterCurrent.sum + mcappData.movingAvgFilterCurrent.buffer[i];
        mcappData.movingAvgFilterCurrent.avg = mcappData.movingAvgFilterCurrent.sum >> CURRENT_MOVING_AVG_FILTER_SCALE;
    }
}
/******************************************************************************
 * Description: The MCAPP_SpeedCalculate calculates the difference in the time
 *              between two sector changes and determines the instantaneous
 *              speed of the motor.
 *****************************************************************************/
void MCAPP_SpeedCalculate(uint32_t speedValue)
{
    mcappData.calculateSpeed.timerDelta = speedValue - mcappData.calculateSpeed.timerPrev; 
    mcappData.calculateSpeed.timerPrev = speedValue;
    
